*** Required Vscode icons

Also vscode icons not available to this stage

#+begin_src emacs-lisp 
;; (use-package vscode-icon
;;   :ensure t)
#+end_src 

Do it again the github way.

#+begin_src emacs-lisp 
(add-to-list 'load-path "/Users/marcohassan/.emacs.d/vscode-icon-emacs")
#+end_src 

#+begin_src emacs-lisp 
(load "vscode-icon")
#+end_src 


#+RESULTS:
| (lambda nil (unless (get-buffer dired-synced-shell) (shell dired-synced-shell)) (process-send-string (get-buffer dired-synced-shell) (format cd %s |

** Ibuffer

[[https://emacs.stackexchange.com/questions/2181/ibuffer-how-to-automatically-create-groups-per-project][This link might still be interesting to look at]].

#+begin_src emacs-lisp 
(setq ibuffer-saved-filter-groups
      (quote (("default"

	       ("terminal"  (or
                             (mode . term-mode)
                             (mode . shell-mode)
                             (mode . eshell-mode)
                             ))	       

               ("sidebar" (mode . dired-sidebar-mode))

               ("org" (mode . org-mode))

               ("python" (or
			  (mode . python-mode)
			  (mode . inferior-python-mode)
                          (name . "^\\*ob-ipython.*")
			  ))

               ("ein"    (name . "^\\*ein.*"))

	       ("magit"  (or
                             (mode . magit-mode)
                             (mode . magit-diff-mode)
                             (mode . magit-process-mode)
			     (name . "^magit.*")
                             ))

	       ("PDFs"      (mode . pdf-view-mode))

               ("planner" (or
                           (name . "^\\*Calendar\\*$")
                           (name . "^diary$")
                           (mode . muse-mode)))
               ("emacs" (or
                         (name . "^\\*scratch\\*$")
                         (name . "^\\*Messages\\*$")
			 ))

               ("dired" (mode . dired-mode))

               ("latex" (mode . latex-mode))

               ("gnus" (or
                        (mode . message-mode)
                        (mode . bbdb-mode)
                        (mode . mail-mode)
                        (mode . gnus-group-mode)
                        (mode . gnus-summary-mode)
                        (mode . gnus-article-mode)
                        (name . "^\\.bbdb$")
                        (name . "^\\.newsrc-dribble")))
	       )
	      )
	     )
)
#+end_src 

#+RESULTS:
| default | (terminal (or (mode . term-mode) (mode . shell-mode) (mode . eshell-mode))) | (sidebar (mode . dired-sidebar-mode)) | (org (mode . org-mode)) | (python (or (mode . python-mode) (mode . inferior-python-mode) (name . ^\*ob-ipython.*))) | (ein (name . ^\*ein.*)) | (magit (or (mode . magit-mode) (mode . magit-diff-mode) (mode . magit-process-mode) (name . ^magit.*))) | (PDFs (mode . pdf-view-mode)) | (planner (or (name . ^\*Calendar\*$) (name . ^diary$) (mode . muse-mode))) | (emacs (or (name . ^\*scratch\*$) (name . ^\*Messages\*$))) | (dired (mode . dired-mode)) | (latex (mode . latex-mode)) | (gnus (or (mode . message-mode) (mode . bbdb-mode) (mode . mail-mode) (mode . gnus-group-mode) (mode . gnus-summary-mode) (mode . gnus-article-mode) (name . ^\.bbdb$) (name . ^\.newsrc-dribble))) |

#+begin_src emacs-lisp 
(add-hook 'ibuffer-mode-hook
          (lambda ()
            (ibuffer-switch-to-saved-filter-groups "default")))
#+end_src 

#+RESULTS:
| pdf-occur-ibuffer-minor-mode | (lambda nil (ibuffer-switch-to-saved-filter-groups default)) |


#+begin_src emacs-lisp 
(global-set-key (kbd "C-x C-b") 'ibuffer)
#+end_src 

#+RESULTS:
: ibuffer

#+begin_src emacs-lisp 
(defun ibuffer-collapse-all-filter-groups ()
  "Collapse all filter groups at once"
  (interactive)
  (setq ibuffer-hidden-filter-groups
        (mapcar #'car (ibuffer-current-filter-groups-with-position)))
  (ibuffer-update nil t))
#+end_src 

#+RESULTS:
: ibuffer-collapse-all-filter-groups

#+begin_src emacs-lisp 
(eval-after-load 'ibuffer'
  (define-key ibuffer-mode-map (kbd "C-c C-c")   'ibuffer-collapse-all-filter-groups) 
)
#+end_src 

#+RESULTS:
: ibuffer-collapse-all-filter-groups

#+begin_src emacs-lisp 
(defun ibuffer-expand-all-filter-groups ()
  "Expand all filter groups at once"
  (interactive)
  (setq ibuffer-hidden-filter-groups nil)
  (ibuffer-update nil t))
#+end_src 

#+RESULTS:
: ibuffer-expand-all-filter-groups

#+begin_src emacs-lisp 
(eval-after-load 'ibuffer'
  (define-key ibuffer-mode-map (kbd "C-c C-e")  'ibuffer-expand-all-filter-groups) 
)
#+end_src 

#+RESULTS:
: ibuffer-expand-all-filter-groups


* Language Server

In order to use the python language server you have to install it via
pip first =pip3 install python-language-server=.

#+begin_src emacs-lisp 
(use-package lsp-mode
  :hook (;; replace XXX-mode with concrete major-mode(e. g. python-mode)
         (python-mode . lsp)
         ;; if you want which-key integration
         ;; (lsp-mode . lsp-enable-which-key-integration)
	 )
  :commands lsp
  )
#+end_src 

#+RESULTS:
| lsp | elpy-mode | smart-hungry-delete-default-c-mode-common-hook | doom-modeline-env-setup-python |

Some config.

#+begin_src emacs-lisp 
;; company completing
(setq lsp-prefer-capf t)
(setq gc-cons-threshold 100000000)
;; set prefix for lsp-command-keymap (few alternatives - "C-l", "C-c l")
(setq lsp-keymap-prefix "C-c s-l")
#+end_src 

#+RESULTS:
: C-c s-l

Notice that you have to toggle
=lsp-ui-sidebar-toggle-symbols-info=. This is a very valuable thing to
do.

#+begin_src emacs-lisp 
(use-package lsp-ui
  :custom-face
  (lsp-ui-sideline-code-action ((t (:inherit warning))))
  :hook (lsp-mode . lsp-ui-mode)
  :init (setq lsp-ui-doc-enable t
	      lsp-ui-doc-use-webkit nil
	      lsp-ui-doc-delay 0.2
	      lsp-ui-doc-include-signature t
	      lsp-ui-doc-position 'top
	      lsp-ui-doc-border (face-foreground 'default)
	      lsp-eldoc-enable-hover nil ; Disable eldoc displays in minibuffer

	      lsp-ui-sideline-enable t
	      lsp-ui-sideline-show-hover nil
	      lsp-ui-sideline-show-diagnostics nil
	      lsp-ui-sideline-ignore-duplicate t

	      lsp-ui-imenu-enable t
	      lsp-ui-imenu-colors `(,(face-foreground 'font-lock-keyword-face)
				    ,(face-foreground 'font-lock-string-face)
				    ,(face-foreground 'font-lock-constant-face)
				    ,(face-foreground 'font-lock-variable-name-face)))

  :config
  (add-to-list 'lsp-ui-doc-frame-parameters '(right-fringe . 8))

  ;; `C-g'to close doc
  (advice-add #'keyboard-quit :before #'lsp-ui-doc-hide)

  ;; Reset `lsp-ui-doc-background' after loading theme
  (add-hook 'after-load-theme-hook
	    (lambda ()
	      (setq lsp-ui-doc-border (face-foreground 'default))
	      (set-face-background 'lsp-ui-doc-background
				   (face-background 'tooltip)))))
#+end_src 

#+RESULTS:
| lsp-ui-mode |


To integrate further and to resolve the issue with python debugging.

https://github.com/emacsmirror/dap-mode#installation-1

#+begin_src emacs-lisp 
 (use-package dap-mode
   :quelpa (dap-mode :fetcher github :repo "emacsmirror/dap-mode"))

(require 'dap-python)

 #+end_src 

Moreover it is possible to integrate the language server with org in
the editing buffer of =C-'=.

This was not integrated so far. You can read more about that [[https://github.com/emacs-lsp/lsp-mode/issues/377][here]].



* PDF viewer

First run on Mac

#+begin_example
$ brew install poppler automake
$ export PKG_CONFIG_PATH=/usr/local/Cellar/zlib/1.2.8/lib/pkgconfig:/usr/local/lib/pkgconfig:/opt/X11/lib/pkgconfig
#+end_example

As on the [[https://github.com/politza/pdf-tools][official webpage]].

#+begin_src emacs-lisp 
;; Then:
(use-package pdf-tools
  :ensure t
  :config
  (custom-set-variables
    '(pdf-tools-handle-upgrades nil))
  (setq pdf-info-epdfinfo-program "/usr/local/bin/epdfinfo"))
#+end_src 


#+begin_src emacs-lisp 
;; (setenv "PATH" (concat (getenv "PATH") ":/usr/local/bin"))
#+end_src 

#+begin_src emacs-lisp 
;; Finally:
;; just run it once. Otherwise it asks to rebuild on each start-up
;; (setenv "PKG_CONFIG_PATH" "/usr/local/Cellar/zlib/1.2.8/lib/pkgconfig:/usr/local/lib/pkgconfig:/opt/X11/lib/pkgconfig")
(pdf-tools-install)
#+end_src 


#+RESULTS:
: /usr/bin:/bin:/usr/sbin:/sbin:/Users/marcohassan/.nvm/versions/node/v8.9.0/bin/:/usr/local/bin


